import numpy as np
import matplotlib.pyplot as plt

# 1. Сгенерировать массив значений x (с шагом 0.01).
x = np.arange(-2 * np.pi, 2 * np.pi, 0.01) # генерирую от -2пи до 2пи для бОльшей наглядности

# 2. Вычислить соответствующие значения y от x (используйте numpy).
y = np.sin(x) + 0.5 * np.sin(3 * x) # функция, которую использую для построения

# 3. Построить график с подписями осей и заголовком.
plt.plot(x, y)
plt.title('Периодическая функция: sin(x) + 0.5 * sin(3 * x)')
plt.xlabel('x')
plt.ylabel('y')
plt.grid(True) # сетка

# 4. Отобразить график на экране.
plt.show()

# картинка вывода графика синсудоиды у меня не прогрузилась, 
# надеюсь, что вид соотвествует
